app/controllers/locales_controller.rb

  def index
    @locales = Locale.all
---
SELECT "locales".* FROM "locales"

    def set_locale
      @locale = Locale.find(params[:id])
---
SELECT  "locales".* FROM "locales" WHERE "locales"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]